In [2]:
import numpy as np
from datascience import *

1. A table named pay contains one row for each faculty member and these columns:<br>
<ul>
<li>dept: a string, the department of the faculty member.</li>
<li>name: a string, the first name of the faculty member.</li>
<li>role: a string, one of: Assistant Professor, Associate Professor, Professor, or Lecturer.</li>
<li>salary: an int, last yearâ€™s salary paid by the university.</li>
</ul>

In [15]:
pay = Table().with_columns(
    'dept', make_array('Journalism', 'Economics', 'South & Southeast Asian Studies','Journalism','Journalism','Economics'),
    'name', make_array('Jeremy', 'Christina', 'Penelope','Martin','Maya','John'),
    'role', make_array('Lecturer', 'Professor', 'Associate Professor','Lecturer','Lecturer','Lecturer'),
    'salary', make_array(111528,349727,127119,200001,191789,253492)
)
pay

dept                            | name      | role                | salary
Journalism                      | Jeremy    | Lecturer            | 111528
Economics                       | Christina | Professor           | 349727
South & Southeast Asian Studies | Penelope  | Associate Professor | 127119
Journalism                      | Martin    | Lecturer            | 200001
Journalism                      | Maya      | Lecturer            | 191789
Economics                       | John      | Lecturer            | 253492

Compute the total salary amount paid to all faculty

In [4]:
sum(pay.column("salary"))

1233656

The name of the third highest paid faculty member. (Assume no two faculty have the same salary.)

In [6]:
pay.sort("salary", descending=True).row(2).item(1)

'Martin'

The number of lecturers in the department that has the most lecturers. (One has more than the rest.)

In [13]:
pay.where("role","Lecturer").group("dept").sort("count", descending=True).row(0).item(1)

3

The average faculty salary after all faculty members get a 10% raise each year for three years.

In [17]:
def compound_interest(principal):
    return principal * (1 + .1)**3

pay_future = pay.with_column("future_pay", pay.apply(compound_interest, "salary"))
pay_future.show()
sum(pay_future.column("salary")) / pay_future.num_rows

205609.33333333334

# Section 2

Each row of the trip table from lecture describes a single bicycle rental in the San Francisco area. Durations are integers representing times in seconds. <br>
Firstly Load table trip

In [18]:
trip = Table.read_table("trip.csv")

In [20]:
trip.show(10)

Write a Python expression below each of the following descriptions that computes its value. You may use
up to two lines and introduce variables.

The average duration of a rental that lasted more than 2 minutes.

In [21]:
two_mins = trip.where("Duration", are.above(120))
avg_duration = sum(two_mins.column("Duration"))/two_mins.num_rows
avg_duration

1054.1654810047276

The number of rentals that started at the San Francisco Caltrain station.

In [22]:
number_rentals = trip.where("Start Station", "San Francisco Caltrain (Townsend at 4th)").num_rows
number_rentals

26304

Work with first 1000 rows of trip table. The name of the station where the most rentals ended (assume no ties).

In [25]:
name_most_rentals = trip.take(1_000).group("End Station").sort("count", descending=True).row(0).item(0)
name_most_rentals

'2nd at Townsend'

The number of stations for which the average duration ending at that station was at least 300 seconds.

In [28]:
temp_table = trip.group("End Station", np.mean)
number_stations = temp_table.where("Duration mean", are.above_or_equal_to(300)).num_rows
number_stations

70